$(function(){
    var address = {
        A:[ "安新","安国","安平","安泽","阿鲁科尔沁旗","敖汉旗","阿荣旗","阿尔山","阿巴嘎旗","阿拉善盟",
            "阿拉善左旗","阿拉善右旗","鞍山","安图","安达","安吉","安庆","安溪","安义","安远","安福",
            "安丘","安阳", "安阳","安陆","安化","安乡","安仁","安岳","阿坝藏族羌族自治州","阿坝","安顺",
            "安龙","安宁","昂仁","安多","阿里地区","安塞","安康","阿克塞哈萨克族自治县","阿拉尔","阿拉山口",
            "阿克苏地区","阿克苏","阿瓦提","阿图什","阿克陶","阿合奇","阿勒泰地区","阿勒泰","澳门"],
        B:[ "北京","霸州","保定","博野","泊头","柏乡","保德","包头","巴林左旗","巴林右旗","巴彦淖尔","北镇",
            "本溪","本溪满族自治县","北票","白城","白山","宾县","巴彦","拜泉","勃利","宝清", "北安","宝应",
            "滨海", "蚌埠","亳州", "滨州","博兴","博爱","宝丰","泌阳","保康","巴东","保靖","博罗","宾阳","百色",
            "北流","博白","北海","巴马瑶族自治县","白沙黎族自治县","保亭黎族苗族自治县","北川羌族自治县","宝兴",
            "巴中", "白玉","巴塘","布拖","毕节","保山","宾川","白朗","八宿","边坝"],
        C:[ "昌黎","赤城","磁县","成安","承德","承德","沧州","沧县","长治","长治","赤峰","察哈尔右翼前旗",
            "察哈尔右翼中旗","察哈尔右翼后旗","陈巴尔虎旗","长海","朝阳","朝阳","昌图","长春","长岭","长白朝鲜族自治县",
            "崇明","常熟","常州","淳安","慈溪","苍南","长兴","常山","巢湖","长丰","滁州","池州","长泰","长汀","柴桑",
            "崇义","崇仁","昌邑","昌乐","长岛","茌平","曹县","成武","长垣","长葛","长阳土家族自治县","赤壁","崇阳",
            "长沙","长沙","常宁","常德","茶陵","辰溪"],
        D:[ "大城","大厂回族自治县","定州","定兴","大名","东光","大宁","大同","大同","代县","定襄","达尔罕茂明安联合旗",
            "达拉特旗","磴口","东乌珠穆沁旗","多伦","大连","丹东","东港","灯塔","大石桥","调兵山","德惠","敦化","大安",
            "东丰","东辽","大庆","杜尔伯特蒙古族自治县","东宁","大兴安岭地区","丹阳", "东台","东海","德清","东阳","岱山",
            "定远","当涂","砀山","东至","德化","东山","大田","都昌","德安","德兴","大余","定南","东平","东阿","东营",
            "东明","德州","登封","郸城"],
        F:[ "阜平","肥乡","丰宁满族自治县","阜城","浮山","汾西","繁","方山","汾阳","丰镇","法库","抚顺","抚顺","阜新",
            "阜新蒙古族自治县","凤城","扶余","抚松","方正","富锦","抚远","富裕","丰县","阜宁", "肥东","肥西","繁昌",
            "凤台","凤阳","阜阳","阜南","福州","福清","福安","福鼎","浮梁","分宜","丰城","奉新","抚州","费县","肥城",
            "封丘","扶沟","方城","范县","房县","凤凰","佛山","丰顺","封开","佛冈","富川瑶族自治县","扶绥",
            "凤山","防城港"],
        G:[ "高邑","固安","高碑店","高阳","沽源","广平","馆陶","广宗","故城","古交","古县","广灵","高平","固阳",
            "根河","盖州","公主岭","甘南","高邮","灌云","灌南","固镇","广德","光泽","古田","共青城","高安","赣州",
            "广昌","贵溪","高密","高青","冠县","高唐","广饶","巩义","固始","光山","公安","谷城","广水","桂阳","桂东",
            "古丈","广州","广宁","高州","桂林","灌阳","恭城瑶族自治县","贵港","桂平","高县","珙县","古蔺","广汉"]
    };
    for (var i in address){
        var addresslist = address[i];
        var dl = $("<dl>");
        dl.attr("id","al"+i);
        $("#address").append(dl);
        var dt = $("<dt>");
        dt.text(i);
        dl.append(dt);
        for (var j=0; j<addresslist.length; j++){
            var dd = $("<dd>");
            var a = $("<a>");
            var ad = addresslist[j];
            a.attr("id",i+j);
            a.text(addresslist[j]);
            dd.append(a);
            dl.append(dd);
            var obj = $("#"+i+j);
            //console.log(obj.attr("id"));
            //obj.on("click",function(ad){
            //    return function (ad){
            //        console.log(obj.text().toString());
            //        $("#now_address").html(ad+"<div class='angle'></div>");
            //    };
            //}(j));
            //obj.onclick = function(){
            //    $("#now_address").html(addresslist[j]+"<div class='angle'></div>");
            //}
        }
    }
    var srt = $("#choose_address").css("display");
    $("#now_address").on("click",function(){
        if (srt == "none"){
            $("#choose_address").css("display","block");
            srt = "block";
        }
        else {
            $(".choose_address").css("display","none");
            srt = "none";
        }
    });
});
